# ExternalServiceId Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServiceId Class
Members See Also
---
Unique identifier of an external service.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class ExternalServiceId : GuidEnum
```

Visual Basic
---
```text
Public Class ExternalServiceId _
	Inherits GuidEnum
```

Visual C++
---
```text
public ref class ExternalServiceId : public GuidEnum
```

# Remarks
Each external service must have a unique ExternalServiceId. The Id can be registered with Revit for servers to easily find it. Unique ExternalServiceId should be created using GUID generation tool. ExternalServiceId can later be used to access registered external services.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..GuidEnum Autodesk.Revit.DB.ExternalService..::..ExternalServiceId
# See Also
ExternalServiceId Members
Autodesk.Revit.DB.ExternalService Namespace